In [1]:
import sqlite3
import pandas as pd

# 1. สร้างการเชื่อมต่อกับ Database (ถ้ายังไม่มีไฟล์ มันจะสร้างใหม่ให้เอง)
conn = sqlite3.connect('retail_store.db')
cursor = conn.cursor()

# 2. สร้างตารางลูกค้า (Customers)
cursor.execute('''
CREATE TABLE IF NOT EXISTS customers (
    customer_id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER,
    city TEXT,
    total_spend INTEGER,
    membership_level TEXT
)
''')

# 3. เพิ่มข้อมูลตัวอย่างลงไป (Mock Data)
data = [
    (1, 'Somchai', 25, 'Bangkok', 1500, 'Bronze'),
    (2, 'Somsri', 32, 'Chiang Mai', 4500, 'Silver'),
    (3, 'John', 45, 'Bangkok', 12000, 'Gold'),
    (4, 'Alice', 28, 'Phuket', 800, 'Bronze'),
    (5, 'David', 35, 'Bangkok', 25000, 'Platinum'),
    (6, 'Eve', 22, 'Khon Kaen', 300, 'Bronze'),
    (7, 'Bob', 40, 'Bangkok', 6000, 'Silver'),
    (8, 'Grace', 30, 'Chonburi', 9500, 'Gold'),
    (9, 'Harry', 50, 'Bangkok', 50, 'Bronze'),
    (10, 'Jane', 27, 'Chiang Mai', 3200, 'Silver')
]

cursor.executemany('INSERT INTO customers VALUES (?,?,?,?,?,?)', data)
conn.commit()

# เช็คว่าข้อมูลมาจริงไหม
df = pd.read_sql("SELECT * FROM customers", conn)
display(df)

# ปิดการเชื่อมต่อ (สำคัญ!)
conn.close()

   customer_id     name  age        city  total_spend membership_level
0            1  Somchai   25     Bangkok         1500           Bronze
1            2   Somsri   32  Chiang Mai         4500           Silver
2            3     John   45     Bangkok        12000             Gold
3            4    Alice   28      Phuket          800           Bronze
4            5    David   35     Bangkok        25000         Platinum
5            6      Eve   22   Khon Kaen          300           Bronze
6            7      Bob   40     Bangkok         6000           Silver
7            8    Grace   30    Chonburi         9500             Gold
8            9    Harry   50     Bangkok           50           Bronze
9           10     Jane   27  Chiang Mai         3200           Silver

In [2]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('retail_store.db')
cursor = conn.cursor()

# 1. สร้างตาราง Orders
cursor.execute('''
CREATE TABLE IF NOT EXISTS orders (
    order_id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    product_name TEXT,
    amount INTEGER,
    order_date TEXT
)
''')

# 2. เพิ่มข้อมูลการสั่งซื้อ (สังเกตเลข customer_id คือตัวเชื่อม)
orders_data = [
    (101, 1, 'Mouse', 500, '2024-01-01'),    # Somchai ซื้อ Mouse
    (102, 1, 'Keyboard', 1000, '2024-01-15'), # Somchai ซื้อ Keyboard อีก
    (103, 3, 'Monitor', 12000, '2024-02-01'), # John ซื้อ Monitor
    (104, 5, 'Laptop', 25000, '2024-02-10'),  # David ซื้อ Laptop
    (105, 2, 'Mouse', 500, '2024-02-12'),     # Somsri ซื้อ Mouse
    (106, 8, 'Headset', 2000, '2024-02-20'),  # Grace ซื้อ Headset
    (107, 8, 'Webcam', 1500, '2024-02-25'),   # Grace ซื้อ Webcam
    (108, 99, 'Unknown', 100, '2024-02-28')   # ใครไม่รู้ (ID 99 ไม่มีในตารางลูกค้า)
]

cursor.executemany('INSERT INTO orders VALUES (?,?,?,?,?)', orders_data)
conn.commit()
print("✅ สร้างตาราง Orders เรียบร้อย!")
conn.close()

✅ สร้างตาราง Orders เรียบร้อย!